Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ། དེ་ལྟ་བུའི་སྦྱིན་པ་ཆེན་པོ་བྱིན་ཞིང་། རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་དང་སྐལ་བ་མཉམ་པར་སྐྱེའོ།
en: So it is that when they dispense such great gifts of generosity, these bodhisattva great beings will be born equal in fortune to the great and lofty royal families.

source: །བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བའི་རིགས་དང་སྐལ་བ་མཉམ་པར་སྐྱེའོ།
en: They will be born equal in fortune to the great and lofty priestly families.

source: །ཁྱིམ་བདག་ཆེ་ཞིང་མཐོ་བའི་རིགས་དང་སྐལ་བ་མཉམ་པར་སྐྱེའོ།
en: They will be born equal in fortune to the great and lofty householder families.

source: །ཁམས་ཀྱི་རྒྱལ་པོར་འགྱུར་རོ། །འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཐོབ་བོ།
en: They will become a regional king, or they will acquire the rank of a universal emperor. “

source: །དེ་དེ་དག་ན་ཡང་སེམས་ཅན་དེ་དག་བསྡུ་བའི་དངོས་པོ་བཞིས་ཡོངས་སུ་སྡུད་དེ།
en: In these states, they will also attract beings through the four attractive qualities.

source: བཞི་གང་ཞེ་ན། སྦྱིན་པ་དང་ཚིག་སྙན་པ་དང་དོན་སྤྱད་པ་དང་། དོན་འཐུན་པས་ཡོངས་སུ་སྡུད་དོ།
en: If you ask what these four are, they comprise generosity, pleasant speech, purposeful activity, and harmony.

source: །དེ་དེ་ལྟར་སྦྱིན་པས་ཡོངས་སུ་བསྡུས་པའི་སེམས་ཅན་དེ་དག་ཀྱང་རིམ་གྱིས་ཚུལ་ཁྲིམས་ལ་རབ་ཏུ་འགོད་དོ། །བཟོད་པ་དང་བརྩོན་འགྲུས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་ལ་རབ་ཏུ་འགོད་དོ།
en: Then gradually they will also establish beings who are attracted by such acts of generosity in ethical discipline, and they will establish them in tolerance, perseverance, meditative stability, and wisdom.

source: །བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ལ་རབ་ཏུ་འགོད་དོ། །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: They will establish them in the four meditative concentrations, the four immeasurable attitudes, and the four formless absorptions.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་རབ་ཏུ་འགོད་དོ།
en: They will establish them in the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path.

source: །འཕགས་པའི་བདེན་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: They will establish them in the four truths of the noble ones, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the five extrasensory powers, all the meditative stabilities, and all the dhāraṇī gateways.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་རབ་ཏུ་འགོད་དོ། །ཡང་དག་པའི་སྐྱོན་མེད་པར་འཇུག་པར་བྱེད་དོ། །རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པར་བྱེད་དོ།
en: They will cause them to enter into the maturity [of the bodhisattvas], and cause them to attain the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and arhatship.

source: །རང་བྱང་ཆུབ་ཐོབ་པར་བྱེད་དོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་སྐུལ་ལོ།
en: They will cause them to attain individual enlightenment, and encourage them to [attain] unsurpassed, complete enlightenment, saying, ‘O you people!

source: །ཀྱེ་སྐྱེས་བུ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་དཀའ་སྟེ།
en: As for unsurpassed, complete enlightenment, it is not difficult to attain consummate buddhahood.

source: ཕྱིན་ཅི་ལོག་གིས་རྨོངས་པའི་སེམས་ཅན་རྣམས་ཀྱིས་ཁོང་དུ་མི་ཆུད་པ་མ་གཏོགས་པར་ཆོས་གང་ལ་སེམས་ཅན་རྣམས་ཆགས་པར་གྱུར་པའི་ཆོས་དེ་ལྟ་བུ་གང་ཡང་ངོ་བོ་ཉིད་ཀྱིས་ཡོད་པ་མེད་ཀྱིས།
en: With the exception of the misunderstanding of deluded beings due to erroneous views, there is nothing at all to which beings are attached that exists according to the essential nature.

source: ཕྱིན་ཅི་ལོག་གི་འཛིན་པ་ཐམས་ཅད་རྒྱུན་ཆོད་ལ་འཁོར་བ་ལས་བདག་ཅག་ཀྱང་ཐར་བར་གྱིས་ཤིག །གཞན་ཡང་ཐར་བར་གྱིས་ཤིག །
en: Therefore, you should sever the continuity of all erroneous grasping and release yourselves from cyclic existence, and you should also release others!

source: དེ་ལྟར་ཁྱེད་ཀྱང་དོན་ཆེན་པོར་གྱིས་ཤིག །གཞན་ཡང་དོན་ཆེན་པོ་ལ་སྦྱོར་ཅིག་ཅེས་ཡང་དག་པར་སྐུལ་བར་བྱེད་དེ།
en: In that manner you yourself should undertake acts of great benefit, and you should also engage others in acts of great benefit!’ “

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱ་སྟེ།
en: Subhūti, bodhisattva great beings should practice the perfection of generosity in that manner.

source: དེ་ལྟར་སྤྱོད་པའི་ཚེ་ཅི་ནས་ཀྱང་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། ནམ་ཡང་ངན་སོང་དུ་མི་ལྟུང་བ་དང་། ནམ་ཡང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མི་བྱེད་པར་མི་འགྱུར་བ་དེ་ལྟར་སྤྱོད་དོ།
en: When they practice in that manner, commencing from the time when they first begin to set their mind on enlightenment, they will never by any means fall into the lower realms, and they will never fail to become a universal emperor and act accordingly.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ས་བོན་ཇི་ལྟ་བ་བཞིན་དུ་འབྲས་བུ་འབྱུང་སྟེ། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དེའི་དྲུང་དུ་སློངས་མོ་བ་གང་ཇི་སྙེད་ཅིག་འོངས་ཀྱང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་མ་གཏོགས་པར་གཞན་གྱི་དོན་དུ་འཁོར་ལོས་སྒྱུར་བ་ཡོངས་སུ་མ་བཟུང་ངོ་ཞེས་དེ་འདི་སྐད་ཅེས་ཟེར་ཏེ།
en: If you ask why, just as a seed produces fruit, however many petitioners approach that universal emperor, the universal emperor will think, ‘I have assumed the fruitional state of a universal emperor for the sake of nothing but the welfare of beings!’ {

source: སུ་ཅི་འདོད་པ་དེ་ཁྱེད་བྱིན་གྱིས་འདི་ནི་ངའི་མ་ཡིན་གྱི་ཁྱེད་ཀྱི་འོ།
en: Ki.VIII: 114} And he will then say, ‘Whatever you want will be given to you! This is yours, not mine!

source: ང་ནི་ནང་གི་གཟུགས་ལའང་དོན་དུ་གཉེར་བ་མེད་ན། གཞན་ལ་ལྟ་ཅི་སྨོས་ཏེ།
en: I have no interest in my inner body, let alone in anything outside!

source: གཞན་དུ་ན་ངས་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་འཁོར་བ་ཡོངས་སུ་བཟུང་གི །
en: I have assumed [a rebirth within] cyclic existence for nothing but the welfare of beings.

source: བདག་གི་དོན་དུ་ནི་འཁོར་བ་དོན་དུ་གཉེར་བ་མ་ཡིན་ནོ་ཞེས་ཏེ།
en: Indeed, I have no interest in cyclic existence for my own sake.’

source: དེ་སྙིང་བརྩེ་བས་སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱས་ཤིང་། སྙིང་རྗེ་ཆེན་པོས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་ཀྱང་། སེམས་ཅན་གང་ཡོངས་སུ་གྲུབ་པ་དེ་ལྟ་བུ་མི་དམིགས་ཏེ། གཞན་དུ་ན་འདུ་ཤེས་དང་། མིང་དང་ཐ་སྙད་ཀྱིས་རྣམ་པར་སྤྱོད་དེ།
en: Having perfected great compassion imbued with love, they act for the benefit of beings through great compassion, but do not apprehend such beings as consummately real, instead engaging with them as notions, names, and conventional expressions.

source: རྣམ་པར་སྤྱོད་པ་དེ་ཡང་སྒྲ་བརྙན་ལྟ་བུར་རྣམ་པར་སྤྱད་དུ་མེད་པར་ཤེས་སོ།
en: They know that even this act of engagement is devoid of engagement, like an echo. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པར་བྱ་སྟེ།
en: Subhūti, bodhisattva great beings should practice the perfection of generosity in that manner.

source: སྤྱོད་པའི་ཚེ་ཅི་ནས་ཀྱང་བདག་གི་ཤ་ཡན་ཆད་ཀྱང་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་མ་བཏང་བ་མེད་པར་བྱ་ན། ཕྱི་རོལ་གྱི་ཡོ་བྱད་གང་གིས་སེམས་ཅན་རྣམས་འཁོར་བ་ལས་ཡོངས་སུ་ཐར་བར་བྱ་བ་དག་ལྟ་སྨོས་སུ་ཡང་མེད་པ་དེ་ལྟར་སྤྱད་པར་བྱའོ།
en: When they do so, there is nothing at all that they should not sacrifice for the sake of beings, even so far as their own flesh, not to even mention the external resources with which they liberate beings from cyclic existence! They should practice in that manner.” “

source: །གསོལ་པ། ཡོ་བྱད་དེ་དག་གང་ལགས།
en: What are those resources?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡོ་བྱད་དོ།
en: The Blessed One replied, “The perfection of generosity is a resource.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཡོ་བྱད་དོ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative stability, and the perfection of wisdom are resources.

source: །ནང་སྟོང་པ་ཉིད་ནི་ཡོ་བྱད་དོ།
en: The emptiness of internal phenomena is a resource.

source: ཕྱི་སྟོང་པ་ཉིད་ནི་ཡོ་བྱད་དོ།
en: The emptiness of external phenomena is a resource.

source: །ཕྱི་ནང་སྟོང་པ་ཉིད་ནི་ཡོ་བྱད་དོ།
en: The emptiness of external and internal phenomena is a resource. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་ཡོ་བྱད་དོ། །དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity, are resources.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་ཡོ་བྱད་དོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: The applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are resources.

source: རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་ནི་ཡོ་བྱད་དོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are resources.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི་ཡོ་བྱད་དོ།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas are resources.

source: །དེ་དག་ནི་ཡོ་བྱད་དེ།
en: These are all resources.

source: ཡོ་བྱད་དེ་དག་གིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་བསྡུས་ཤིང་། རིམ་གྱིས་ཉན་ཐོས་ཀྱི་ཐེག་པ་འམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་འམ། ཐེག་པ་ཆེན་པོ་འམ། ཐེག་པ་གསུམ་པོ་དེ་དག་གིས་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་སྟེ།
en: Through these resources they attract beings and gradually bring them to attain final nirvāṇa by means of the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, the Great Vehicle, or all three vehicles.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས། སེམས་ཅན་རྣམས་ཡོངས་སུ་བསྡུད་པ་ཡིན་ནོ། །རབ་འབྱོར་ཇི་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: Subhūti, it is in this manner that bodhisattva great beings, while maintaining the perfection of generosity, attract beings through the perfection of generosity. “

source: སེམས་ཅན་རྣམས་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྦྱོར་བ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་སེམས་ཅན་རྣམས་ལ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་སྟེ། དེ་སྦྱིན་པ་གཏོང་བའི་ཚེ་འདི་སྐད་ཅེས་བརྗོད་དོ། །རིགས་ཀྱི་བུ་དག་ཚུར་ཤེག་ཚུལ་ཁྲིམས་སྲུངས་ཤིག །ངས་ཁྱེད་ཟས་དང་སྐོམ་དང་གོས་དང་མལ་ཆ་དང་། མེ་ཏོག་དང་། བདུག་
en: Subhūti, if you ask how bodhisattva great beings engage beings in the perfection of ethical discipline, while practicing the perfection of generosity, in this regard, Subhūti, bodhisattva great beings, settled in the perfection of generosity, dispense generosity to beings, and when they dispense generosity, they would say, ‘Come here, noble children!

source: སྤོས་དང་། སྤོས་དང་།
en: You should keep [the vows of] ethical discipline!

source: ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཁྱིམ་དང་ནོར་དང་འབྲུ་དང་ནོར་བུ་དང་མུ་ཏིག་དང་བཻ་ཌཱུརྱ་དང་དུང་དང་མན་ཤེལ་དང་བྱི་རུ་དང་། གསེར་དང་དངུལ་དང་མིའི་ཡོ་བྱད་ཀྱི་རྐྱེན་དང་། ཡོ་བྱད་གང་ཅི་ཡང་རུང་བའི་བར་གྱིས་ཕོངས་པ་མེད་པར་བྱའོ།
en: I will ensure that you are not deprived of food, drink, clothing, bedding, flowers, incense, perfume, garlands, unguents, houses, wealth, grain, gemstones, pearls, beryl, conch, crystal, coral, gold, silver, and the facility of human resources, up to and including any resource whatsoever.

source: །ཁྱེད་ཀྱང་ཕོངས་པས་ཚུལ་ཁྲིམས་ངན་པ་ལ་སྤྱོད་གྲང་ན། ཁྱེད་ཡོ་བྱད་ཐམས་ཅད་དང་། རིན་པོ་ཆེ་བདུན་གྱི་བར་གྱིས་ཕོངས་པ་མེད་པར་བྱས།
en: Since it seems that you engaged in immorality due to deprivation, I will ensure that you are not deprived of any resources and [necessities], up to and including the seven precious materials.

source: དེས་ཁྱེད་སྡོམ་པའི་ཚུལ་ཁྲིམས་ལ་མནོས་ལ། རིམ་གྱིས་ཉན་ཐོས་ཀྱི་ཐེག་པ་འམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་འམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཐེག་པ་འམ། ཐེག་པ་གསུམ་པོ་དེ་དག་གིས་སྡུག་བསྔལ་གྱི་མཐར་ཕྱིན་པར་གྱིས་ཤིག །
en: Consequently, having received the vows of ethical discipline, you should gradually put an end to suffering by means of the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, the vehicle of all-aspect omniscience, or all three vehicles.’ “

source: ཅེས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བདག་ཉིད་ཀྱང་ཚུལ་ཁྲིམས་སྲུང་ངོ་། །གཞན་ཡང་ཚུལ་ཁྲིམས་ལ་ཡང་དག་པར་སྐུལ་ལོ།
en: Those bodhisattva great beings should themselves keep [the vows of] ethical discipline, and they should also encourage others to [keep the vows of] ethical discipline.

source: ཚུལ་ཁྲིམས་ཀྱི་ལེགས་པ་བརྗོད་དོ། །སེམས་ཅན་གཞན་གང་ཚུལ་ཁྲིམས་སྲུང་བ་དེ་དག་གི་ཡང་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་དོ།
en: They also speak in praise of ethical discipline, and they praise and delight in empathy with other beings who keep [the vows of] ethical discipline.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སེམས་ཅན་དེ་དག་དེ་ལྟར་ཚུལ་ཁྲིམས་ལ་སྦྱོར་ཞིང་། ཚུལ་ཁྲིམས་ལ་རབ་ཏུ་བཀོད་དེ།
en: In that manner, bodhisattva great beings engage those beings in ethical discipline and establish them in ethical discipline.

source: རིམ་གྱིས་ཐེག་པ་གསུམ་པོས་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་སྟེ།
en: Gradually they bring them to attain final nirvāṇa by means of the three vehicles.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྡུད་པ་ཡིན་ནོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: Subhūti, it is in that manner that bodhisattva great beings, while maintaining the perfection of generosity, attract beings through the perfection of ethical discipline. {

source: སེམས་ཅན་རྣམས་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྦྱོར་བ་ཡིན་ཞེ་ན།
en: Ki.

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སེམས་ཅན་གང་ཁྲོ་བ་དང་། གནོད་སེམས་སུ་བྱེད་པ་དག་མཐོང་ན། དེ་དག་ལ་འདི་སྐད་ཅེས་ཟེར་རོ། །རིགས་ཀྱི་བུ་དག་ཁྱེད་ཅིའི་རྒྱུས་གནོད་སེམས་སུ་བྱེད་པར་གྱུར།
en: VIII: 115} “Subhūti, if you ask how bodhisattva great beings engage beings in the perfection of tolerance, while practicing the perfection of generosity, in this regard, Subhūti, if bodhisattva great beings, settled in the perfection of generosity, see any beings who are angered or malicious, they would say to them, ‘Noble children, for what reason do you indulge in malice?

source: ཁྱེད་གང་གིས་ཕོངས་ཤིང་གནོད་སེམས་སུ་བྱེད་པར་གྱུར་པ་དེ་དང་དེ་ང་ལས་ལོང་ཤིག །
en: If being deprived of anything causes you to indulge in malice, you should take it from me!

source: ངས་ཁྱེད་ཟས་དང་སྐོམ་དང་མིའི་རྐྱེན་གྱི་ཡོ་བྱད་གང་ཅི་ཡང་རུང་བའི་བར་གྱིས་ཕོང་བ་མེད་པར་བྱས།
en: I will ensure that you are not deprived of food, drink, or any other resources whatsoever, up to and including any of the things that human beings require.

source: ཁྲོ་བ་དང་གནོད་སེམས་མེད་པར་གྱིས་ཤིག་ཅེས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་།
en: You should do away with anger and malice!’ It is in that manner that bodhisattva great beings maintain the perfection of generosity.

source: སེམས་ཅན་དེ་དག་བཟོད་པ་ལ་སྦྱོར་ཏེ། འདི་སྐད་དུ་གཅུགས་གང་གིས་ཁྱེད་ཀྱི་ཁྲོ་བ་སྐྱེ་བར་གྱུར་པ་དེ་ནི་སྙིང་པོ་མེད་པ་སྟེ།
en: They should engage beings in tolerance, saying, ‘The enmity through which your anger arises is pointless.

source: དེ་ལ་དངོས་པོ་གང་ཡང་མེད་དོ།
en: In it there is no entity at all.

source: །ཁྲོ་བ་དེ་ནི་ཡང་དག་པ་མ་ཡིན་པར་ཡོངས་སུ་བརྟགས་པ་སྟེ། དངོས་པོ་གང་གིས་ཕྱིར་ཁྱེད་འཐབ་ཅིང་འཁོན་པ་དང་། གནོད་སེམས་སུ་བྱེད་པར་གྱུར་པ་དང་།
en: This anger is a false imagination.

source: དེ་ལྟར་འཐབས་ཤིང་འཁོན་ཏེ་གནོད་སེམས་སུ་གྱུར་ནས། དབྱིག་པས་འགྱེད་པ་དང་། མཚོན་གྱིས་འདྲེ་བ་དང་། ཕན་ཚུན་གྱི་སྲོག་ལ་རྒོལ་བར་གྱུར་པའི་དངོས་པོ་དེ་ལ། དངོས་པོའི་རང་བཞིན་གང་ཡང་མེད་ན། དེ་ལྟ་ཡིན་ཡང་ཁྱེད་ཡང་དག་པ་མ་ཡིན་པའི་ཡོངས་སུ་རྟོགས་པས་འཁྲུགས་ན།
en: There is no inherent existence of entities at all, and this applies to any entity that might cause you to quarrel and indulge in enmity and malice, or that, having caused you to quarrel and indulge in enmity and malice, might then provoke you into fighting with clubs, piercing with weapons, or robbing one another of life.

source: སེམས་ཅན་དམྱལ་བ་དག་ཏུ་ལྟུང་བར་འགྱུར། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དག་ཏུ་ལྟུང་བར་འགྱུར། དེ་མ་ཡིན་པའི་ངན་སོང་གཞན་དག་ཏུའང་ཁྱེད་སྡུག་བསྔལ་མི་བཟད་པ་དང་། ཚ་ཞིང་རྩུབ་ལ་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་ཉམས་སུ་མྱོང་བར་འགྱུར་གྱིས།
en: Since that is the case, if you are disturbed by false imaginations, you will fall into the hells, you will fall into the animal realm, and into the world of Yama, and in other lower realms apart from those you will also experience intolerable sufferings and unpleasant sensations of heat and harshness.

source: སྐྱེས་བུ་ཁྱེད་རྣམས་དངོས་པོ་མེད་པའི་ཆོས་ཀྱི་དོན་དུ་ལས་གང་ཡོངས་སུ་བཟུང་བས་མིར་སྐྱེ་བ་ཡང་ཐོབ་པར་མི་འགྱུར་ན། སངས་རྒྱས་བྱུང་བ་དང་།
en: As a result of having acquired karma for the sake of something that is a nonentity, you people will fail to obtain even a human birth, not to mention [the prospect] of you encountering a buddha who has appeared!

source: ཕྲད་པར་འགྱུར་བ་ལྟ་སྨོས་སུ་ཡང་མེད་པ་དེ་ལྟ་བུའི་ལས་ཡོངས་སུ་མ་འཛིན་ཅིག །
en: Do not acquire such karma!

source: གྲོགས་པོ་དག་སངས་རྒྱས་འབྱུང་བ་ནི་དཀོན་ནོ།
en: Friends, the appearance of a buddha is rare.

source: །མིར་སྐྱེ་བ་འཐོབ་པ་ནི་དཀོན་ནོ།
en: The obtaining of a human birth is rare.

source: །དལ་བ་ཕུན་སུམ་ཚོགས་པ་ནི་དཀོན་ནོ།
en: The excellence of freedom [to practice the Dharma] is rare.

source: །འཁོར་བ་ལས་ཐར་བ་ནི་དཀོན་ནོ།
en: Release from cyclic existence is rare.

source: །དེ་ལྟ་ཡིན་གྱིས་དལ་བ་འདི་དོན་མེད་པར་མ་བྱ་ཤིག །
en: Since that is the case, do not render this freedom meaningless!

source: མི་ཁོམ་པར་གྱུར་ཅིང་གསོར་མི་རུང་བར་གྱུར་ཏ་རེ་ཞེས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདག་ཉིད་ཀྱང་བཟོད་པ་སྒྲུབ་བོ།
en: Do not resort to unfavorable states [with no freedom to practice the Dharma], and do not resort to unrectifiable states!’ “

source: །གཞན་ཡང་བཟོད་པ་ལ་ཡང་དག་པར་སྐུལ་ལོ།
en: In this regard, bodhisattva great beings should themselves practice tolerance and they should also encourage others to [practice] tolerance.

source: །བཟོད་པའི་ལེགས་པ་རྗོད་དོ། །སེམས་ཅན་གཞན་གང་བཟོད་པ་བསྒོམ་པ་དེ་དག་གི་ཡང་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་དོ།
en: They also speak in praise of tolerance, and they praise and delight in empathy with other beings cultivating tolerance.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སེམས་ཅན་དེ་དག་དེ་ལྟར་བཟོད་པ་ལ་སྦྱར་ཅིང་བཟོད་པ་ལ་རབ་ཏུ་བཀོད་དེ།
en: In that manner bodhisattva great beings engage beings in tolerance and establish them in tolerance.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྡུད་པར་བྱེད་པ་ཡིན་ནོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: VIII: 116} Subhūti, it is in that manner that bodhisattva great beings, while maintaining the perfection of generosity, attract beings through the perfection of tolerance. “

source: སེམས་ཅན་རྣམས་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྦྱོར་བ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ལེ་ལོ་ཅན་བརྩོན་འགྲུས་ཆུང་བ་དག་མཐོང་ན། འདི་སྐད་དུ་ཁྱེད་ཅིའི་ཕྱིར་ལེ་ལོ་བྱེད་ཅེས་བརྗོད་དེ། དེ་དག་རྐྱེན་དང་མི་ལྡན་པའི་ཕྱིར་རོ་ཞེས་ཟེར་ན། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: Subhūti, if you ask how bodhisattva great beings engage beings in the perfection of perseverance, while practicing the perfection of generosity, in this regard, Subhūti, if bodhisattva great beings see beings who are indolent and weak in perseverance, they would say, ‘Why do you act indolently?’

source: སེམས་ཅན་དེ་དག་ལ་འདི་སྐད་ཅེས་ཟེར་ཏེ། ཀྱེ་སྐྱེས་བུ་དག་ངས་སྦྱིན་པའི་རྐྱེན་ཏམ། ཚུལ་ཁྲིམས་ཀྱི་རྐྱེན་ཏམ། བཟོད་པའི་རྐྱེན་ཏམ། གཞན་ཡང་རྣམ་པ་གང་དང་གང་གིས་བརྩོན་འགྲུས་བརྩམ་དུ་རུང་བ་དེ་དག་ངས་ཁྱེད་ལ་ཉེ་བར་བསྒྲུབ་པར་བྱས།
en: If they reply that it is because they lack fortunate conditions, in that case, bodhisattva great beings practicing the perfection of generosity should say to those beings, ‘O people, I will provide you with the favorable condition of generosity, the favorable condition of ethical discipline, the favorable condition of tolerance, or anything else that will enable you to undertake perseverance.

source: བརྩོན་འགྲུས་རྩོམས་ཤིག་ཅེས་ནས།
en: Undertake perseverance!’

source: སེམས་ཅན་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེའི་ཡོ་བྱད་ལ་སྤྱོད་ཅིང་། ལུས་སམ་སེམས་ཀྱིས་བརྩོན་འགྲུས་རྩོམ་སྟེ།
en: Consequently, these beings enjoy the resources of those bodhisattva great beings and they undertake acts of physical and mental perseverance.

source: དེ་དག་ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་ཀྱིས་དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། དགེ་བའི་ཆོས་དེ་དག་གིས་འཕགས་པ་ཟག་པ་མེད་པའི་ཆོས་རྣམས་སྒོམ་མོ།
en: Through physical and mental perseverance they perfect all virtuous attributes and through these virtuous attributes they cultivate attributes that are without contamination.

source: །དེ་དག་བསྒོམས་པས་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་འཐོབ་བོ། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་འཐོབ་བོ།
en: By having cultivated these, they will attain the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and arhatship.

source: །རང་བྱང་ཆུབ་འཐོབ་བོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: They will attain individual enlightenment, and they will attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདག་ཉིད་ཀྱང་བརྩོན་འགྲུས་རྩོམ་མོ། །གཞན་ཡང་བརྩོན་འགྲུས་ལ་ཡང་དག་པར་སྐུལ་ལོ། །བརྩོན་འགྲུས་ཀྱི་ལེགས་པར་རྗོད་དོ།
en: In this regard, bodhisattva great beings should themselves undertake acts of perseverance and they should also encourage others to [undertake] acts of perseverance.

source: །སེམས་ཅན་གཞན་གང་བརྩོན་འགྲུས་རྩོམ་པ་དེ་དག་གི་ཡང་ལེགས་པར་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་དོ།
en: They also speak in praise of perseverance, and they praise and delight in empathy with other beings who undertake acts of perseverance.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སེམས་ཅན་དེ་དག་དེ་ལྟར་བརྩོན་འགྲུས་ལ་སྦྱར་ཅིང་། བརྩོན་འགྲུས་ལ་རབ་ཏུ་བཀོད་དེ།
en: In that manner bodhisattva great beings engage beings in perseverance and establish them in perseverance.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྡུད་པ་ཡིན་ནོ།
en: Subhūti, it is in that manner that bodhisattva great beings, while maintaining the perfection of generosity, attract beings through the perfection of perseverance. “
